public/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Website</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Website</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgd21cf28">Welcome</a>
<ul>
<li><a href="#org6b739f6">Interests</a></li>
<li><a href="#org301ab17">Projects</a></li>
</ul>
</li>
<li><a href="#org51b1925">Projects</a>
<ul>
<li><a href="#orga9cd394">PathFinding</a></li>
</ul>
</li>
<li><a href="#org9caedac">Tutorials</a>
<ul>
<li><a href="#org01d13b2">Installing Mano Simulator on Windows/Linux</a></li>
</ul>
</li>
<li><a href="#org69cce38">Data Simulation with D3.js</a></li>
<li><a href="#org07ea72e">Github</a></li>
<li><a href="#org5f739d1"><span class="todo TODO">TODO</span> Data Base of Notes</a></li>
<li><a href="#org480b8f6"><span class="todo TODO">TODO</span> Links</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgd21cf28" class="outline-2">
<h2 id="orgd21cf28">Welcome</h2>
<div class="outline-text-2" id="text-orgd21cf28">
<p>
The purpose of this site is to display my portfolio.  These include all my past procts as well as all relevant accomplishments.  The site is nothing fancy, it is generated via org-mode.  A markdown like language in Emacs that exports easily to html.  This way I can keep the site simple while having it focus on my work.  This site is generated via.
</p>
</div>

<div id="outline-container-org6b739f6" class="outline-3">
<h3 id="org6b739f6">Interests</h3>
<div class="outline-text-3" id="text-org6b739f6">
<ul class="org-ul">
<li>Keyboard/Layout/Current Speed/VIM with the layout</li>
<li>Emacs/Layout philsophy/Reason I use emacs</li>
<li>Emacs is <a href="https://www.youtube.com/channel/UCAiiOTio8Yu69c3XnR7nQBQ">System Crafters</a> (Add site link).</li>
<li>Guix why I use it</li>
</ul>
</div>
</div>
<div id="outline-container-org301ab17" class="outline-3">
<h3 id="org301ab17">Projects</h3>
<div class="outline-text-3" id="text-org301ab17">
<p>
<a href="./README.html">init.el</a>
</p>
</div>
</div>
</div>
<div id="outline-container-org51b1925" class="outline-2">
<h2 id="org51b1925">Projects</h2>
<div class="outline-text-2" id="text-org51b1925">
<ul class="org-ul">
<li><a href="./projects/video.html">Internship video</a></li>
<li><a href="./projects/arcade-game.html">Arcade Game</a></li>
<li><a href="./projects/path-finder.html">Path finder</a></li>
<li><a href="./projects/baseball-stats.html">Baseball stats finder</a></li>
<li>County mapping</li>
</ul>



<p>
<a href="../Pirate/index.html">game</a>
</p>
</div>

<div id="outline-container-orga9cd394" class="outline-3">
<h3 id="orga9cd394">PathFinding</h3>
<div class="outline-text-3" id="text-orga9cd394">
<p>
This was my first successful hackathon my team ended up winning a prize which was really cool.  The idea was to be able to import a image and draw paths on that image.  One could then generate the shortest path based on the users start and end point on the map.
</p>

<p>
<a href="../PathFinding/index.html">TCNJ Mapping</a>
</p>
</div>
</div>
</div>

<div id="outline-container-org9caedac" class="outline-2">
<h2 id="org9caedac">Tutorials</h2>
<div class="outline-text-2" id="text-org9caedac">
<p>
I wrote this tutorial for using a assembler in my computer architecture class.
</p>
</div>

<div id="outline-container-org01d13b2" class="outline-3">
<h3 id="org01d13b2">Installing Mano Simulator on Windows/Linux</h3>
<div class="outline-text-3" id="text-org01d13b2">
<p>
<a href="./mano_instructions.html">Mano Sim</a>
</p>
</div>
</div>
</div>

<div id="outline-container-org69cce38" class="outline-2">
<h2 id="org69cce38">Data Simulation with D3.js</h2>
<div class="outline-text-2" id="text-org69cce38">
<p>
<a href="../batting/main.html">Base Ball Stats</a>
</p>
</div>
</div>

<div id="outline-container-org07ea72e" class="outline-2">
<h2 id="org07ea72e">Github</h2>
<div class="outline-text-2" id="text-org07ea72e">
<p>
Here's my <a href="https://github.com/cerealman23">github</a>
</p>
</div>
</div>

<div id="outline-container-org5f739d1" class="outline-2">
<h2 id="org5f739d1"><span class="todo TODO">TODO</span> Data Base of Notes</h2>
<div class="outline-text-2" id="text-org5f739d1">
<p>
"I want to add my org roam files here"
<a href="./RoamNotes/20210831121049-classes.html">org-roam</a>
</p>
</div>
</div>

<div id="outline-container-org480b8f6" class="outline-2">
<h2 id="org480b8f6"><span class="todo TODO">TODO</span> Links</h2>
<div class="outline-text-2" id="text-org480b8f6">
<p>
<a href="https://www.instagram.com/malcolmkahora/">Instagram</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.1 (<a href="https://orgmode.org">Org</a> mode 9.5.2)</p>
</div>
</body>
</html>
